#=======================================================#
#	时间：2016年5月7日 09:41:24							#
#	功能：学习Perl的第一个Hello world程序				#
#	目的：Learning Perl									#
#		^_^……！											#
#=======================================================#

#!C:\Perl\bin

use 5.010;

print "Hello world!\n";
say "Hello world! for use 5.010;\n";			#use 5.010;


#=======================================================#
#	时间：2016年5月7日 09:44:51							#
#		  2016年5月8日 18:07:42 add say					#
#	结果												#
#	F:\CC\Perl\Learning_Perl\Chapter_1>perl ex1_1.pl	#
#	Hello world!										#
#		^_^……！											#
#=======================================================#
