#=======================================================#
#	时间：2016年5月23日 21:02:23						#
#	功能：第七章 正则表达式 练习题 1					#
#	目的：Learning Perl									#
#		^_^……！											#
#=======================================================#

## Copyright (C) 2016 by CC
#!C:\Perl\bin

#use utf8;
use warnings;
use strict;

while (<>) {
	if (/fred/) {
		print $_;
	}
}



#===========================================================
#	时间：2016年5月23日 21:14:55							
#	结果：												
#		F:\CC\Perl\Learning_Perl\Chapter_7>ex7_1.pl test.txt
#		fred flintstone
#		frederick
#		Alfred
#		^_^……！												
#===========================================================	
